TexasInstruments/mcupsdk-core/test/kernel/dpl/dpl_ut/nortos/common/DebugP_shmLogWriter/awr294x-evm/c66ss0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AWR294X" --package "ETS" --part "Default" --context "c66ss0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.17.0+3128"}
 */

/**
 * Import the modules used in this configuration.
 */
const cache_c6x = scripting.addModule("/kernel/dpl/cache_c6x");
const debug_log = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg = scripting.addModule("/kernel/dpl/dpl_cfg");

/**
 * Write custom configuration values to the imported modules.
 */
cache_c6x.l2size                         = 128;
cache_c6x.marRegionConfig.create(3);
cache_c6x.marRegionConfig[0].$name       = "kernel_dpl_cache_c6x_mar0";
cache_c6x.marRegionConfig[0].baseAddr    = 0x88000000;
cache_c6x.marRegionConfig[0].enableCache = true;
cache_c6x.marRegionConfig[1].$name       = "kernel_dpl_cache_c6x_mar1";
cache_c6x.marRegionConfig[1].baseAddr    = 0xC0000000;
cache_c6x.marRegionConfig[2].$name       = "kernel_dpl_cache_c6x_mar2";
cache_c6x.marRegionConfig[2].baseAddr    = 0xC6000000;

debug_log.enableUartLog               = true;

debug_log.uartLog.$name               = "CONFIG_UART0";
debug_log.uartLog.DSS_UART.$assign    = "DSS_UARTA";
debug_log.uartLog.DSS_UART.RX.$assign = "PAD_DD";
debug_log.uartLog.DSS_UART.TX.$assign = "PAD_DC";

const edma                         = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1                        = edma.addInstance({}, false);
edma1.$name                        = "CONFIG_EDMA0";
debug_log.uartLog.edmaConfig       = edma1;
edma1.edmaRmDmaCh[0].$name         = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name        = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name           = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name         = "CONFIG_EDMA_RM3";
edma1.edmaRmReservedDmaCh[0].$name = "CONFIG_EDMA_RM4";
